#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=552d7d72-58e1-463e-bd7b-c57c70a95a2a]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5252461f-7408-4c7c-9cbe-e7113410d43b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0ddeb6dc-f469-4cf5-8eab-9f8a6ca58315]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c9f3b0e2-bc88-49c1-9863-3414a2cb4a79]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3c515f9a-b6ec-4dad-9ff0-4667f8b71fb6]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a2126d74-60db-46ab-9d86-1a84fe33431d]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=39fbfd06-cc3b-4ed0-8adb-6d513d56e771]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e5792029-c769-47b0-95a6-15426fd180fd]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=34cb76f3-30ab-48ec-869a-bf245b90f52b]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=11740a6d-e1bc-4358-b69b-d20c40ad6ede]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=14f3dc3a-cfcd-436b-b267-2a181961b625]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=618a82ed-5c6b-41a3-999e-01d0457c5c3c]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d1b3b191-7029-4459-95ea-7c904cadb99c]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0964a154-2cf8-4eed-a061-8c5b8839090b]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d939d3b4-e962-4aea-a653-2e5aeb16b57c]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d0122292-d4d9-44f9-892d-aa6dcaa69d2b]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75c5ce43-21c0-4adc-9c88-b67094370396]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a0a5f6e5-de03-4e5f-b0cd-22cc5de0d553]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=54a520a1-78f0-475e-b1bf-f480bc485eae]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=87306e94-70d5-484f-aa0d-21dbbce7de00]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=003cf642-2daa-425c-ba40-6c348cecd3d5]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a60895e6-31eb-49b6-b120-a599a8f55155]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d493cc8a-7bce-4676-8316-a9f3100b59f7]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c73d46d8-f273-407e-832e-5c19f5d337d0]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=049a894e-ad74-4d60-b19e-ed6a569d6565]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7745dbee-3336-4404-aa78-c2d67d1c4958]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=63dbdba0-7fd9-4250-b5f1-34e82b06cfd5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d191c0be-d2b3-4270-a403-fbef89d05707]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=730c7919-42d5-4016-bb52-785cf12f4ae4]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=400e247f-98d9-4a7a-8494-d32a81226d15]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7bd5b16c-fefe-4e95-a641-0f75dc0c47a5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bc5b1458-f8c1-486e-a5f7-382aad9d5fa7]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0f8617cd-94cf-4ff1-bd10-49ff7bf1b808]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a35f2dfc-21bf-4274-bbf6-f21b32736668]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bd1a6f53-5acb-4da8-b04f-95f041b78904]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a5c19d39-037f-462f-8096-406cd3377833]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3c2361df-196b-4b25-9089-015dfdc554b9]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1bb329fc-e993-4aa8-b40a-739dd401e68c]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=00379430-fae3-4f59-b314-a0bd77668387]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=39737cb4-868e-40c3-9a54-106a0395b34d]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5602d3f9-b4c0-4fa9-8e57-01318a4891df]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0773fe0e-7b1e-421c-ae9c-b7b997889bfb]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=765827c5-99c5-4030-bd61-551c384ddb61]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3cd1b910-c387-4d7a-9c51-2dde9bb56760]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=187148cb-2e2a-4921-9def-0fc4df0ca294]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=26305d12-5c0b-49e9-a360-5d3784fadeef]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c98fb603-0c2c-426d-b72b-d5e338ad42c5]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20874bc4-0a09-4ba7-8712-e033f5fc4930]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d5598f44-c8f0-4693-a581-fb09a16e5f7e]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2f373551-5dfa-4871-9b64-7842ce3be63b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f84f8b82-f177-48a1-9a70-3b374ac8a655]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=df9bdce5-dc0d-4292-9a77-8a5b27569056]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fce77ec9-bf10-45fc-8036-6b3a7e3da42b]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3a430144-645a-4924-9dfb-a340ceb46759]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9aa05a12-d3f3-478a-8864-a8b80ff52aff]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28a6c18b-6277-44e7-ab77-c9cf786b7059]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=618c409f-0ca6-4c05-8621-fcdaa8828f9e]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=64b84ffe-f251-4ed3-b8fe-2b350b83b530]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9ade2a26-88d0-4e23-b1da-46dee36b161b]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7cb6c37c-994c-4966-b075-32437a8019f0]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e0ae682c-dffc-496d-93d8-ba53309c13e5]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e30590aa-91d1-4853-bc0a-6cb0bec6b2ab]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4098305e-ddf1-4491-afd7-9c1198b0f915]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=596c5147-ab9b-465a-9cfb-c053f587320f]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=0d3cb042-4415-4ec2-85f2-a7842c735ba4]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8cb41a00-1ca8-45e7-9251-da8615bbc4d0]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=64f4da34-9368-4cea-b47d-b5f0fd4e277c]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0f521005-8b3e-458d-924d-ac032a340baf]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=41430063-49d0-45cd-bc9d-256545fc7800]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=722e7cb3-109f-4692-8c64-c5903cc51dcd]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fd58d902-a307-4efe-8051-7d66667e1896]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bdb67f2a-8319-425e-a8cb-5407955ca12c]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5015aa1c-f7ca-4bca-ad2f-ea4a9b30b97c]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f2bb9d00-08dd-4b3a-a57e-e1bacc2a3cb5]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0dcd6d11-dcb3-4590-9c0e-3c6601caf946]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c93e4154-8e16-490c-b274-9363dda145ff]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63d308e-aa95-4341-88bc-b61f9e1735ec]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95136448-40b2-405f-a0f7-2a54b784b98d]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2c31e35e-08ed-4297-a6ed-54718d5fa904]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=73177236-f5f4-4950-8721-034b60f710b7]
module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-4786.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=12c7725d-3ce3-4f28-8bcb-1b8ac3d5e59a]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=de9ad7db-2d2e-4f79-907d-97788cadd138]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5e34dd3c-edd9-4599-826c-b06d1f284f58]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=63fbfd9d-59ad-4439-946d-7d21f1acaada]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e5d92db7-5726-49ee-91fe-46d9e9ba8b9c]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5c624639-70ab-4aa3-a568-bb207f322356]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d613e3f5-5e7d-49ea-9797-5af3db1b0f92]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a9dc9fb8-d02b-465c-99f5-ee9fe1c34974]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a6e1d5a9-a8b7-422c-834a-229255d10384]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "fffffffffffffffffffffaaee-5"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "fffffffffffffffffffffaaee-5"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_fffffffffffffffffffffaaee-5.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "fffffffffffffffffffffaaee-5"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "fffffffffffffffffffffaaee-5"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*